zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/include/pio/pic32cm6408pl10032.h
#define PIN_PA28B_ADC0_AIN28                       _UINT32_(28)
#define MUX_PA28B_ADC0_AIN28                       _UINT32_(1) 
#define PINMUX_PA28B_ADC0_AIN28                    ((PIN_PA28B_ADC0_AIN28 << 16) | MUX_PA28B_ADC0_AIN28)
#define PORT_PA28B_ADC0_AIN28                      (_UINT32_(1) << 28)

#define PIN_PA29B_ADC0_AIN29                       _UINT32_(29)
#define MUX_PA29B_ADC0_AIN29                       _UINT32_(1) 
#define PINMUX_PA29B_ADC0_AIN29                    ((PIN_PA29B_ADC0_AIN29 << 16) | MUX_PA29B_ADC0_AIN29)
#define PORT_PA29B_ADC0_AIN29                      (_UINT32_(1) << 29)

#define PIN_PA31B_ADC0_AIN31                       _UINT32_(31)
#define MUX_PA31B_ADC0_AIN31                       _UINT32_(1) 
#define PINMUX_PA31B_ADC0_AIN31                    ((PIN_PA31B_ADC0_AIN31 << 16) | MUX_PA31B_ADC0_AIN31)
#define PORT_PA31B_ADC0_AIN31                      (_UINT32_(1) << 31)

#define PIN_PA23B_ADC0_VREFP                       _UINT32_(23)
#define MUX_PA23B_ADC0_VREFP                       _UINT32_(1) 
#define PINMUX_PA23B_ADC0_VREFP                    ((PIN_PA23B_ADC0_VREFP << 16) | MUX_PA23B_ADC0_VREFP)
#define PORT_PA23B_ADC0_VREFP                      (_UINT32_(1) << 23)

/* =================== PORT definition for CCL peripheral =================== */
#define PIN_PA00H_CCL_IN0                          _UINT32_(0) 
#define MUX_PA00H_CCL_IN0                          _UINT32_(7) 
#define PINMUX_PA00H_CCL_IN0                       ((PIN_PA00H_CCL_IN0 << 16) | MUX_PA00H_CCL_IN0)
#define PORT_PA00H_CCL_IN0                         (_UINT32_(1) << 0)

#define PIN_PA01H_CCL_IN1                          _UINT32_(1) 
#define MUX_PA01H_CCL_IN1                          _UINT32_(7) 
#define PINMUX_PA01H_CCL_IN1                       ((PIN_PA01H_CCL_IN1 << 16) | MUX_PA01H_CCL_IN1)
#define PORT_PA01H_CCL_IN1                         (_UINT32_(1) << 1)

#define PIN_PA02H_CCL_IN2                          _UINT32_(2) 
#define MUX_PA02H_CCL_IN2                          _UINT32_(7) 
#define PINMUX_PA02H_CCL_IN2                       ((PIN_PA02H_CCL_IN2 << 16) | MUX_PA02H_CCL_IN2)
#define PORT_PA02H_CCL_IN2                         (_UINT32_(1) << 2)

#define PIN_PA08H_CCL_IN3                          _UINT32_(8) 
#define MUX_PA08H_CCL_IN3                          _UINT32_(7) 
#define PINMUX_PA08H_CCL_IN3                       ((PIN_PA08H_CCL_IN3 << 16) | MUX_PA08H_CCL_IN3)
#define PORT_PA08H_CCL_IN3                         (_UINT32_(1) << 8)

#define PIN_PA09H_CCL_IN4                          _UINT32_(9) 
#define MUX_PA09H_CCL_IN4                          _UINT32_(7) 
#define PINMUX_PA09H_CCL_IN4                       ((PIN_PA09H_CCL_IN4 << 16) | MUX_PA09H_CCL_IN4)
#define PORT_PA09H_CCL_IN4                         (_UINT32_(1) << 9)

#define PIN_PA10H_CCL_IN5                          _UINT32_(10)
#define MUX_PA10H_CCL_IN5                          _UINT32_(7) 
#define PINMUX_PA10H_CCL_IN5                       ((PIN_PA10H_CCL_IN5 << 16) | MUX_PA10H_CCL_IN5)
#define PORT_PA10H_CCL_IN5                         (_UINT32_(1) << 10)

#define PIN_PA17H_CCL_IN7                          _UINT32_(17)
#define MUX_PA17H_CCL_IN7                          _UINT32_(7) 
#define PINMUX_PA17H_CCL_IN7                       ((PIN_PA17H_CCL_IN7 << 16) | MUX_PA17H_CCL_IN7)
#define PORT_PA17H_CCL_IN7                         (_UINT32_(1) << 17)

#define PIN_PA18H_CCL_IN8                          _UINT32_(18)
#define MUX_PA18H_CCL_IN8                          _UINT32_(7) 
#define PINMUX_PA18H_CCL_IN8                       ((PIN_PA18H_CCL_IN8 << 16) | MUX_PA18H_CCL_IN8)
#define PORT_PA18H_CCL_IN8                         (_UINT32_(1) << 18)

#define PIN_PA24H_CCL_IN9                          _UINT32_(24)
#define MUX_PA24H_CCL_IN9                          _UINT32_(7) 
#define PINMUX_PA24H_CCL_IN9                       ((PIN_PA24H_CCL_IN9 << 16) | MUX_PA24H_CCL_IN9)
#define PORT_PA24H_CCL_IN9                         (_UINT32_(1) << 24)

#define PIN_PA25H_CCL_IN10                         _UINT32_(25)
#define MUX_PA25H_CCL_IN10                         _UINT32_(7) 
#define PINMUX_PA25H_CCL_IN10                      ((PIN_PA25H_CCL_IN10 << 16) | MUX_PA25H_CCL_IN10)
#define PORT_PA25H_CCL_IN10                        (_UINT32_(1) << 25)

#define PIN_PA26H_CCL_IN11                         _UINT32_(26)
#define MUX_PA26H_CCL_IN11                         _UINT32_(7) 
#define PINMUX_PA26H_CCL_IN11                      ((PIN_PA26H_CCL_IN11 << 16) | MUX_PA26H_CCL_IN11)
#define PORT_PA26H_CCL_IN11                        (_UINT32_(1) << 26)

#define PIN_PA03H_CCL_OUT0                         _UINT32_(3) 
#define MUX_PA03H_CCL_OUT0                         _UINT32_(7) 
#define PINMUX_PA03H_CCL_OUT0                      ((PIN_PA03H_CCL_OUT0 << 16) | MUX_PA03H_CCL_OUT0)
#define PORT_PA03H_CCL_OUT0                        (_UINT32_(1) << 3)

#define PIN_PA06H_CCL_OUT0                         _UINT32_(6) 
#define MUX_PA06H_CCL_OUT0                         _UINT32_(7) 
#define PINMUX_PA06H_CCL_OUT0                      ((PIN_PA06H_CCL_OUT0 << 16) | MUX_PA06H_CCL_OUT0)
#define PORT_PA06H_CCL_OUT0                        (_UINT32_(1) << 6)

#define PIN_PA11H_CCL_OUT1                         _UINT32_(11)
#define MUX_PA11H_CCL_OUT1                         _UINT32_(7) 
#define PINMUX_PA11H_CCL_OUT1                      ((PIN_PA11H_CCL_OUT1 << 16) | MUX_PA11H_CCL_OUT1)
#define PORT_PA11H_CCL_OUT1                        (_UINT32_(1) << 11)

#define PIN_PA19H_CCL_OUT2                         _UINT32_(19)
#define MUX_PA19H_CCL_OUT2                         _UINT32_(7) 
#define PINMUX_PA19H_CCL_OUT2                      ((PIN_PA19H_CCL_OUT2 << 16) | MUX_PA19H_CCL_OUT2)
#define PORT_PA19H_CCL_OUT2                        (_UINT32_(1) << 19)

#define PIN_PA22H_CCL_OUT2                         _UINT32_(22)
#define MUX_PA22H_CCL_OUT2                         _UINT32_(7) 
#define PINMUX_PA22H_CCL_OUT2                      ((PIN_PA22H_CCL_OUT2 << 16) | MUX_PA22H_CCL_OUT2)
#define PORT_PA22H_CCL_OUT2                        (_UINT32_(1) << 22)

#define PIN_PA27H_CCL_OUT3                         _UINT32_(27)
#define MUX_PA27H_CCL_OUT3                         _UINT32_(7) 
#define PINMUX_PA27H_CCL_OUT3                      ((PIN_PA27H_CCL_OUT3 << 16) | MUX_PA27H_CCL_OUT3)
#define PORT_PA27H_CCL_OUT3                        (_UINT32_(1) << 27)

/* =================== PORT definition for EIC peripheral =================== */
#define PIN_PA00A_EIC_EXTINT0                      _UINT32_(0) 
#define MUX_PA00A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PA00A_EIC_EXTINT0                   ((PIN_PA00A_EIC_EXTINT0 << 16) | MUX_PA00A_EIC_EXTINT0)
#define PORT_PA00A_EIC_EXTINT0                     (_UINT32_(1) << 0)
#define PIN_PA00A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PA00 External Interrupt Line */

#define PIN_PA17A_EIC_EXTINT1                      _UINT32_(17)
#define MUX_PA17A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PA17A_EIC_EXTINT1                   ((PIN_PA17A_EIC_EXTINT1 << 16) | MUX_PA17A_EIC_EXTINT1)
#define PORT_PA17A_EIC_EXTINT1                     (_UINT32_(1) << 17)
#define PIN_PA17A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PA17 External Interrupt Line */

