zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/include/pio/pic32cm6408pl10032.h
#define PIN_PA05P_PTC_PAD5                         _UINT32_(5) 
#define MUX_PA05P_PTC_PAD5                         _UINT32_(15)
#define PINMUX_PA05P_PTC_PAD5                      ((PIN_PA05P_PTC_PAD5 << 16) | MUX_PA05P_PTC_PAD5)
#define PORT_PA05P_PTC_PAD5                        (_UINT32_(1) << 5)

#define PIN_PA06P_PTC_PAD6                         _UINT32_(6) 
#define MUX_PA06P_PTC_PAD6                         _UINT32_(15)
#define PINMUX_PA06P_PTC_PAD6                      ((PIN_PA06P_PTC_PAD6 << 16) | MUX_PA06P_PTC_PAD6)
#define PORT_PA06P_PTC_PAD6                        (_UINT32_(1) << 6)

#define PIN_PA07P_PTC_PAD7                         _UINT32_(7) 
#define MUX_PA07P_PTC_PAD7                         _UINT32_(15)
#define PINMUX_PA07P_PTC_PAD7                      ((PIN_PA07P_PTC_PAD7 << 16) | MUX_PA07P_PTC_PAD7)
#define PORT_PA07P_PTC_PAD7                        (_UINT32_(1) << 7)

#define PIN_PA17P_PTC_PAD17                        _UINT32_(17)
#define MUX_PA17P_PTC_PAD17                        _UINT32_(15)
#define PINMUX_PA17P_PTC_PAD17                     ((PIN_PA17P_PTC_PAD17 << 16) | MUX_PA17P_PTC_PAD17)
#define PORT_PA17P_PTC_PAD17                       (_UINT32_(1) << 17)

#define PIN_PA18P_PTC_PAD18                        _UINT32_(18)
#define MUX_PA18P_PTC_PAD18                        _UINT32_(15)
#define PINMUX_PA18P_PTC_PAD18                     ((PIN_PA18P_PTC_PAD18 << 16) | MUX_PA18P_PTC_PAD18)
#define PORT_PA18P_PTC_PAD18                       (_UINT32_(1) << 18)

#define PIN_PA19P_PTC_PAD19                        _UINT32_(19)
#define MUX_PA19P_PTC_PAD19                        _UINT32_(15)
#define PINMUX_PA19P_PTC_PAD19                     ((PIN_PA19P_PTC_PAD19 << 16) | MUX_PA19P_PTC_PAD19)
#define PORT_PA19P_PTC_PAD19                       (_UINT32_(1) << 19)

#define PIN_PA20P_PTC_PAD20                        _UINT32_(20)
#define MUX_PA20P_PTC_PAD20                        _UINT32_(15)
#define PINMUX_PA20P_PTC_PAD20                     ((PIN_PA20P_PTC_PAD20 << 16) | MUX_PA20P_PTC_PAD20)
#define PORT_PA20P_PTC_PAD20                       (_UINT32_(1) << 20)

#define PIN_PA21P_PTC_PAD21                        _UINT32_(21)
#define MUX_PA21P_PTC_PAD21                        _UINT32_(15)
#define PINMUX_PA21P_PTC_PAD21                     ((PIN_PA21P_PTC_PAD21 << 16) | MUX_PA21P_PTC_PAD21)
#define PORT_PA21P_PTC_PAD21                       (_UINT32_(1) << 21)

#define PIN_PA22P_PTC_PAD22                        _UINT32_(22)
#define MUX_PA22P_PTC_PAD22                        _UINT32_(15)
#define PINMUX_PA22P_PTC_PAD22                     ((PIN_PA22P_PTC_PAD22 << 16) | MUX_PA22P_PTC_PAD22)
#define PORT_PA22P_PTC_PAD22                       (_UINT32_(1) << 22)

#define PIN_PA23P_PTC_PAD23                        _UINT32_(23)
#define MUX_PA23P_PTC_PAD23                        _UINT32_(15)
#define PINMUX_PA23P_PTC_PAD23                     ((PIN_PA23P_PTC_PAD23 << 16) | MUX_PA23P_PTC_PAD23)
#define PORT_PA23P_PTC_PAD23                       (_UINT32_(1) << 23)

#define PIN_PA24P_PTC_PAD24                        _UINT32_(24)
#define MUX_PA24P_PTC_PAD24                        _UINT32_(15)
#define PINMUX_PA24P_PTC_PAD24                     ((PIN_PA24P_PTC_PAD24 << 16) | MUX_PA24P_PTC_PAD24)
#define PORT_PA24P_PTC_PAD24                       (_UINT32_(1) << 24)

#define PIN_PA25P_PTC_PAD25                        _UINT32_(25)
#define MUX_PA25P_PTC_PAD25                        _UINT32_(15)
#define PINMUX_PA25P_PTC_PAD25                     ((PIN_PA25P_PTC_PAD25 << 16) | MUX_PA25P_PTC_PAD25)
#define PORT_PA25P_PTC_PAD25                       (_UINT32_(1) << 25)

#define PIN_PA26P_PTC_PAD26                        _UINT32_(26)
#define MUX_PA26P_PTC_PAD26                        _UINT32_(15)
#define PINMUX_PA26P_PTC_PAD26                     ((PIN_PA26P_PTC_PAD26 << 16) | MUX_PA26P_PTC_PAD26)
#define PORT_PA26P_PTC_PAD26                       (_UINT32_(1) << 26)

#define PIN_PA27P_PTC_PAD27                        _UINT32_(27)
#define MUX_PA27P_PTC_PAD27                        _UINT32_(15)
#define PINMUX_PA27P_PTC_PAD27                     ((PIN_PA27P_PTC_PAD27 << 16) | MUX_PA27P_PTC_PAD27)
#define PORT_PA27P_PTC_PAD27                       (_UINT32_(1) << 27)

#define PIN_PA28P_PTC_PAD28                        _UINT32_(28)
#define MUX_PA28P_PTC_PAD28                        _UINT32_(15)
#define PINMUX_PA28P_PTC_PAD28                     ((PIN_PA28P_PTC_PAD28 << 16) | MUX_PA28P_PTC_PAD28)
#define PORT_PA28P_PTC_PAD28                       (_UINT32_(1) << 28)

#define PIN_PA29P_PTC_PAD29                        _UINT32_(29)
#define MUX_PA29P_PTC_PAD29                        _UINT32_(15)
#define PINMUX_PA29P_PTC_PAD29                     ((PIN_PA29P_PTC_PAD29 << 16) | MUX_PA29P_PTC_PAD29)
#define PORT_PA29P_PTC_PAD29                       (_UINT32_(1) << 29)

#define PIN_PA31P_PTC_PAD31                        _UINT32_(31)
#define MUX_PA31P_PTC_PAD31                        _UINT32_(15)
#define PINMUX_PA31P_PTC_PAD31                     ((PIN_PA31P_PTC_PAD31 << 16) | MUX_PA31P_PTC_PAD31)
#define PORT_PA31P_PTC_PAD31                       (_UINT32_(1) << 31)

#define PIN_PA21B_PTC_EXTCINT                      _UINT32_(21)
#define MUX_PA21B_PTC_EXTCINT                      _UINT32_(1) 
#define PINMUX_PA21B_PTC_EXTCINT                   ((PIN_PA21B_PTC_EXTCINT << 16) | MUX_PA21B_PTC_EXTCINT)
#define PORT_PA21B_PTC_EXTCINT                     (_UINT32_(1) << 21)

#define PIN_PA22B_PTC_EXTCINT1                     _UINT32_(22)
#define MUX_PA22B_PTC_EXTCINT1                     _UINT32_(1) 
#define PINMUX_PA22B_PTC_EXTCINT1                  ((PIN_PA22B_PTC_EXTCINT1 << 16) | MUX_PA22B_PTC_EXTCINT1)
#define PORT_PA22B_PTC_EXTCINT1                    (_UINT32_(1) << 22)

/* ================= PORT definition for SERCOM0 peripheral ================= */
#define PIN_PA10D_SERCOM0_PAD0                     _UINT32_(10)
#define MUX_PA10D_SERCOM0_PAD0                     _UINT32_(3) 
#define PINMUX_PA10D_SERCOM0_PAD0                  ((PIN_PA10D_SERCOM0_PAD0 << 16) | MUX_PA10D_SERCOM0_PAD0)
#define PORT_PA10D_SERCOM0_PAD0                    (_UINT32_(1) << 10)

#define PIN_PA00C_SERCOM0_PAD0                     _UINT32_(0) 
#define MUX_PA00C_SERCOM0_PAD0                     _UINT32_(2) 
#define PINMUX_PA00C_SERCOM0_PAD0                  ((PIN_PA00C_SERCOM0_PAD0 << 16) | MUX_PA00C_SERCOM0_PAD0)
#define PORT_PA00C_SERCOM0_PAD0                    (_UINT32_(1) << 0)

