zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/include/pio/pic32cm6408pl10032.h
#define PIN_PA04C_SERCOM0_PAD0                     _UINT32_(4) 
#define MUX_PA04C_SERCOM0_PAD0                     _UINT32_(2) 
#define PINMUX_PA04C_SERCOM0_PAD0                  ((PIN_PA04C_SERCOM0_PAD0 << 16) | MUX_PA04C_SERCOM0_PAD0)
#define PORT_PA04C_SERCOM0_PAD0                    (_UINT32_(1) << 4)

#define PIN_PA11D_SERCOM0_PAD1                     _UINT32_(11)
#define MUX_PA11D_SERCOM0_PAD1                     _UINT32_(3) 
#define PINMUX_PA11D_SERCOM0_PAD1                  ((PIN_PA11D_SERCOM0_PAD1 << 16) | MUX_PA11D_SERCOM0_PAD1)
#define PORT_PA11D_SERCOM0_PAD1                    (_UINT32_(1) << 11)

#define PIN_PA01C_SERCOM0_PAD1                     _UINT32_(1) 
#define MUX_PA01C_SERCOM0_PAD1                     _UINT32_(2) 
#define PINMUX_PA01C_SERCOM0_PAD1                  ((PIN_PA01C_SERCOM0_PAD1 << 16) | MUX_PA01C_SERCOM0_PAD1)
#define PORT_PA01C_SERCOM0_PAD1                    (_UINT32_(1) << 1)

#define PIN_PA05C_SERCOM0_PAD1                     _UINT32_(5) 
#define MUX_PA05C_SERCOM0_PAD1                     _UINT32_(2) 
#define PINMUX_PA05C_SERCOM0_PAD1                  ((PIN_PA05C_SERCOM0_PAD1 << 16) | MUX_PA05C_SERCOM0_PAD1)
#define PORT_PA05C_SERCOM0_PAD1                    (_UINT32_(1) << 5)

#define PIN_PA08D_SERCOM0_PAD2                     _UINT32_(8) 
#define MUX_PA08D_SERCOM0_PAD2                     _UINT32_(3) 
#define PINMUX_PA08D_SERCOM0_PAD2                  ((PIN_PA08D_SERCOM0_PAD2 << 16) | MUX_PA08D_SERCOM0_PAD2)
#define PORT_PA08D_SERCOM0_PAD2                    (_UINT32_(1) << 8)

#define PIN_PA31D_SERCOM0_PAD2                     _UINT32_(31)
#define MUX_PA31D_SERCOM0_PAD2                     _UINT32_(3) 
#define PINMUX_PA31D_SERCOM0_PAD2                  ((PIN_PA31D_SERCOM0_PAD2 << 16) | MUX_PA31D_SERCOM0_PAD2)
#define PORT_PA31D_SERCOM0_PAD2                    (_UINT32_(1) << 31)

#define PIN_PA02C_SERCOM0_PAD2                     _UINT32_(2) 
#define MUX_PA02C_SERCOM0_PAD2                     _UINT32_(2) 
#define PINMUX_PA02C_SERCOM0_PAD2                  ((PIN_PA02C_SERCOM0_PAD2 << 16) | MUX_PA02C_SERCOM0_PAD2)
#define PORT_PA02C_SERCOM0_PAD2                    (_UINT32_(1) << 2)

#define PIN_PA06C_SERCOM0_PAD2                     _UINT32_(6) 
#define MUX_PA06C_SERCOM0_PAD2                     _UINT32_(2) 
#define PINMUX_PA06C_SERCOM0_PAD2                  ((PIN_PA06C_SERCOM0_PAD2 << 16) | MUX_PA06C_SERCOM0_PAD2)
#define PORT_PA06C_SERCOM0_PAD2                    (_UINT32_(1) << 6)

#define PIN_PA09D_SERCOM0_PAD3                     _UINT32_(9) 
#define MUX_PA09D_SERCOM0_PAD3                     _UINT32_(3) 
#define PINMUX_PA09D_SERCOM0_PAD3                  ((PIN_PA09D_SERCOM0_PAD3 << 16) | MUX_PA09D_SERCOM0_PAD3)
#define PORT_PA09D_SERCOM0_PAD3                    (_UINT32_(1) << 9)

#define PIN_PA03C_SERCOM0_PAD3                     _UINT32_(3) 
#define MUX_PA03C_SERCOM0_PAD3                     _UINT32_(2) 
#define PINMUX_PA03C_SERCOM0_PAD3                  ((PIN_PA03C_SERCOM0_PAD3 << 16) | MUX_PA03C_SERCOM0_PAD3)
#define PORT_PA03C_SERCOM0_PAD3                    (_UINT32_(1) << 3)

#define PIN_PA07C_SERCOM0_PAD3                     _UINT32_(7) 
#define MUX_PA07C_SERCOM0_PAD3                     _UINT32_(2) 
#define PINMUX_PA07C_SERCOM0_PAD3                  ((PIN_PA07C_SERCOM0_PAD3 << 16) | MUX_PA07C_SERCOM0_PAD3)
#define PORT_PA07C_SERCOM0_PAD3                    (_UINT32_(1) << 7)

/* ================= PORT definition for SERCOM1 peripheral ================= */
#define PIN_PA00D_SERCOM1_PAD0                     _UINT32_(0) 
#define MUX_PA00D_SERCOM1_PAD0                     _UINT32_(3) 
#define PINMUX_PA00D_SERCOM1_PAD0                  ((PIN_PA00D_SERCOM1_PAD0 << 16) | MUX_PA00D_SERCOM1_PAD0)
#define PORT_PA00D_SERCOM1_PAD0                    (_UINT32_(1) << 0)

#define PIN_PA26D_SERCOM1_PAD0                     _UINT32_(26)
#define MUX_PA26D_SERCOM1_PAD0                     _UINT32_(3) 
#define PINMUX_PA26D_SERCOM1_PAD0                  ((PIN_PA26D_SERCOM1_PAD0 << 16) | MUX_PA26D_SERCOM1_PAD0)
#define PORT_PA26D_SERCOM1_PAD0                    (_UINT32_(1) << 26)

#define PIN_PA10C_SERCOM1_PAD0                     _UINT32_(10)
#define MUX_PA10C_SERCOM1_PAD0                     _UINT32_(2) 
#define PINMUX_PA10C_SERCOM1_PAD0                  ((PIN_PA10C_SERCOM1_PAD0 << 16) | MUX_PA10C_SERCOM1_PAD0)
#define PORT_PA10C_SERCOM1_PAD0                    (_UINT32_(1) << 10)

#define PIN_PA20C_SERCOM1_PAD0                     _UINT32_(20)
#define MUX_PA20C_SERCOM1_PAD0                     _UINT32_(2) 
#define PINMUX_PA20C_SERCOM1_PAD0                  ((PIN_PA20C_SERCOM1_PAD0 << 16) | MUX_PA20C_SERCOM1_PAD0)
#define PORT_PA20C_SERCOM1_PAD0                    (_UINT32_(1) << 20)

#define PIN_PA31C_SERCOM1_PAD0                     _UINT32_(31)
#define MUX_PA31C_SERCOM1_PAD0                     _UINT32_(2) 
#define PINMUX_PA31C_SERCOM1_PAD0                  ((PIN_PA31C_SERCOM1_PAD0 << 16) | MUX_PA31C_SERCOM1_PAD0)
#define PORT_PA31C_SERCOM1_PAD0                    (_UINT32_(1) << 31)

#define PIN_PA01D_SERCOM1_PAD1                     _UINT32_(1) 
#define MUX_PA01D_SERCOM1_PAD1                     _UINT32_(3) 
#define PINMUX_PA01D_SERCOM1_PAD1                  ((PIN_PA01D_SERCOM1_PAD1 << 16) | MUX_PA01D_SERCOM1_PAD1)
#define PORT_PA01D_SERCOM1_PAD1                    (_UINT32_(1) << 1)

#define PIN_PA27D_SERCOM1_PAD1                     _UINT32_(27)
#define MUX_PA27D_SERCOM1_PAD1                     _UINT32_(3) 
#define PINMUX_PA27D_SERCOM1_PAD1                  ((PIN_PA27D_SERCOM1_PAD1 << 16) | MUX_PA27D_SERCOM1_PAD1)
#define PORT_PA27D_SERCOM1_PAD1                    (_UINT32_(1) << 27)

#define PIN_PA11C_SERCOM1_PAD1                     _UINT32_(11)
#define MUX_PA11C_SERCOM1_PAD1                     _UINT32_(2) 
#define PINMUX_PA11C_SERCOM1_PAD1                  ((PIN_PA11C_SERCOM1_PAD1 << 16) | MUX_PA11C_SERCOM1_PAD1)
#define PORT_PA11C_SERCOM1_PAD1                    (_UINT32_(1) << 11)

#define PIN_PA02D_SERCOM1_PAD2                     _UINT32_(2) 
#define MUX_PA02D_SERCOM1_PAD2                     _UINT32_(3) 
#define PINMUX_PA02D_SERCOM1_PAD2                  ((PIN_PA02D_SERCOM1_PAD2 << 16) | MUX_PA02D_SERCOM1_PAD2)
#define PORT_PA02D_SERCOM1_PAD2                    (_UINT32_(1) << 2)

#define PIN_PA24D_SERCOM1_PAD2                     _UINT32_(24)
#define MUX_PA24D_SERCOM1_PAD2                     _UINT32_(3) 
#define PINMUX_PA24D_SERCOM1_PAD2                  ((PIN_PA24D_SERCOM1_PAD2 << 16) | MUX_PA24D_SERCOM1_PAD2)
#define PORT_PA24D_SERCOM1_PAD2                    (_UINT32_(1) << 24)

#define PIN_PA08C_SERCOM1_PAD2                     _UINT32_(8) 
#define MUX_PA08C_SERCOM1_PAD2                     _UINT32_(2) 
#define PINMUX_PA08C_SERCOM1_PAD2                  ((PIN_PA08C_SERCOM1_PAD2 << 16) | MUX_PA08C_SERCOM1_PAD2)
#define PORT_PA08C_SERCOM1_PAD2                    (_UINT32_(1) << 8)

#define PIN_PA22C_SERCOM1_PAD2                     _UINT32_(22)
#define MUX_PA22C_SERCOM1_PAD2                     _UINT32_(2) 
#define PINMUX_PA22C_SERCOM1_PAD2                  ((PIN_PA22C_SERCOM1_PAD2 << 16) | MUX_PA22C_SERCOM1_PAD2)
#define PORT_PA22C_SERCOM1_PAD2                    (_UINT32_(1) << 22)

#define PIN_PA03D_SERCOM1_PAD3                     _UINT32_(3) 
#define MUX_PA03D_SERCOM1_PAD3                     _UINT32_(3) 
#define PINMUX_PA03D_SERCOM1_PAD3                  ((PIN_PA03D_SERCOM1_PAD3 << 16) | MUX_PA03D_SERCOM1_PAD3)
#define PORT_PA03D_SERCOM1_PAD3                    (_UINT32_(1) << 3)

