zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/include/pio/pic32cm6408pl10032.h
#define PIN_PA25F_TCC0_WO1                         _UINT32_(25)
#define MUX_PA25F_TCC0_WO1                         _UINT32_(5) 
#define PINMUX_PA25F_TCC0_WO1                      ((PIN_PA25F_TCC0_WO1 << 16) | MUX_PA25F_TCC0_WO1)
#define PORT_PA25F_TCC0_WO1                        (_UINT32_(1) << 25)

#define PIN_PA02F_TCC0_WO2                         _UINT32_(2) 
#define MUX_PA02F_TCC0_WO2                         _UINT32_(5) 
#define PINMUX_PA02F_TCC0_WO2                      ((PIN_PA02F_TCC0_WO2 << 16) | MUX_PA02F_TCC0_WO2)
#define PORT_PA02F_TCC0_WO2                        (_UINT32_(1) << 2)

#define PIN_PA10F_TCC0_WO2                         _UINT32_(10)
#define MUX_PA10F_TCC0_WO2                         _UINT32_(5) 
#define PINMUX_PA10F_TCC0_WO2                      ((PIN_PA10F_TCC0_WO2 << 16) | MUX_PA10F_TCC0_WO2)
#define PORT_PA10F_TCC0_WO2                        (_UINT32_(1) << 10)

#define PIN_PA18F_TCC0_WO2                         _UINT32_(18)
#define MUX_PA18F_TCC0_WO2                         _UINT32_(5) 
#define PINMUX_PA18F_TCC0_WO2                      ((PIN_PA18F_TCC0_WO2 << 16) | MUX_PA18F_TCC0_WO2)
#define PORT_PA18F_TCC0_WO2                        (_UINT32_(1) << 18)

#define PIN_PA26F_TCC0_WO2                         _UINT32_(26)
#define MUX_PA26F_TCC0_WO2                         _UINT32_(5) 
#define PINMUX_PA26F_TCC0_WO2                      ((PIN_PA26F_TCC0_WO2 << 16) | MUX_PA26F_TCC0_WO2)
#define PORT_PA26F_TCC0_WO2                        (_UINT32_(1) << 26)

#define PIN_PA03F_TCC0_WO3                         _UINT32_(3) 
#define MUX_PA03F_TCC0_WO3                         _UINT32_(5) 
#define PINMUX_PA03F_TCC0_WO3                      ((PIN_PA03F_TCC0_WO3 << 16) | MUX_PA03F_TCC0_WO3)
#define PORT_PA03F_TCC0_WO3                        (_UINT32_(1) << 3)

#define PIN_PA11F_TCC0_WO3                         _UINT32_(11)
#define MUX_PA11F_TCC0_WO3                         _UINT32_(5) 
#define PINMUX_PA11F_TCC0_WO3                      ((PIN_PA11F_TCC0_WO3 << 16) | MUX_PA11F_TCC0_WO3)
#define PORT_PA11F_TCC0_WO3                        (_UINT32_(1) << 11)

#define PIN_PA19F_TCC0_WO3                         _UINT32_(19)
#define MUX_PA19F_TCC0_WO3                         _UINT32_(5) 
#define PINMUX_PA19F_TCC0_WO3                      ((PIN_PA19F_TCC0_WO3 << 16) | MUX_PA19F_TCC0_WO3)
#define PORT_PA19F_TCC0_WO3                        (_UINT32_(1) << 19)

#define PIN_PA27F_TCC0_WO3                         _UINT32_(27)
#define MUX_PA27F_TCC0_WO3                         _UINT32_(5) 
#define PINMUX_PA27F_TCC0_WO3                      ((PIN_PA27F_TCC0_WO3 << 16) | MUX_PA27F_TCC0_WO3)
#define PORT_PA27F_TCC0_WO3                        (_UINT32_(1) << 27)



#endif /* _pic32cm6408pl10032_GPIO_H_ */

